# **Mise en œuvre des VLANs sur un switch de niveau 3**

## **I) Configuration initiale du switch**

### **Contexte**

* Objectif : configurer un **switch L3**, créer des VLANs et permettre le **routage inter-VLANs**.
* Bonnes pratiques VLAN :

  * Placer les ressources nécessaires sur le même VLAN pour réduire la **latence** et éviter les **goulots d’étranglement**.
  * Éviter de créer trop de VLANs si le réseau n’est pas très sollicité.
  * Les VLANs servent à :

    * Contrôle du **broadcast**
    * **Sécurité**
    * Gestion des **adresses IP**
    * Consolidation des **ressources réseau**

### **Exemple de topologie**

* PC : 192.168.10.10
* Serveur : 192.168.20.10
* Switch de niveau 3

### **Étapes de configuration**

1. **Allumer les interfaces physiques**

```
Switch> enable
Switch# conf t
Switch(config)# int fa0/1
Switch(config-if)# no shutdown
Switch(config-if)# int fa0/2
Switch(config-if)# no shutdown
Switch(config-if)# int fa0/3
Switch(config-if)# no shutdown
Switch(config-if)# exit
```

2. **Renommer le switch**

```
Switch(config)# hostname commutateur
```

3. **Activer le routage Layer 3**

```
commutateur(config)# ip routing
```

---

## **II) Configuration des interfaces pour les VLANs**

### **Création et affectation des VLANs**

1. **VLAN 10 (PC)**

```
commutateur# conf t
commutateur(config)# vlan 10
commutateur(config-vlan)# int fa0/1
commutateur(config-if)# switchport mode access
commutateur(config-if)# switchport access vlan 10
commutateur(config-if)# do show vlan
```

2. **VLAN 20 (Serveur)**

```
commutateur(config)# vlan 20
commutateur(config-vlan)# int fa0/2
commutateur(config-if)# switchport mode access
commutateur(config-if)# switchport access vlan 20
commutateur(config-if)# do show vlan
```

* Vérification : les VLANs sont **activés et visibles** sur les interfaces correspondantes.

---

## **III) Mise en place du routage inter-VLANs**

### **Activation des interfaces VLAN**

```
commutateur# conf t
commutateur(config)# int vlan 10
commutateur(config-if)# no shutdown
commutateur(config)# int vlan 20
commutateur(config-if)# no shutdown
```

### **Assignation des adresses IP aux VLANs**

* VLAN 10 → passerelle pour PC VLAN 10

```
commutateur(config)# int vlan 10
commutateur(config-if)# ip address 192.168.10.1 255.255.255.0
```

* VLAN 20 → passerelle pour serveur VLAN 20

```
commutateur(config)# int vlan 20
commutateur(config-if)# ip address 192.168.20.1 255.255.255.0
```

### **Test de communication**

* Vérifier la connectivité avec un **ping** du PC (VLAN 10) vers le serveur (VLAN 20).
* Le paquet transite par le **switch L3**, SVI agissant comme passerelle, et revient vers le PC.
* Résultat : **Successful** (communication inter-VLAN opérationnelle).

---

## **IV) Points clés**

* Un **switch L3** permet :

  * Création et activation des VLANs
  * Routage inter-VLAN via **SVI**
  * Réduction de la nécessité d’un routeur dédié
* Les **SVI** (Switch Virtual Interface) jouent le rôle de **passerelle pour chaque VLAN**.
* Importance de la **planification du réseau** : limiter les VLANs inutiles et optimiser l’accès aux ressources.

---