# Fiche complète — De la configuration **switch** à la configuration **routeur**
---

## 1) Préparer la topologie & plan d’adressage

1. Dessine ta topologie (switch(es), routeur(s), PC, câbles).
2. Établis un plan d’adressage (réseaux, passerelles), plan de VLANs (ID + nom) et liste des ports par rôle.
3. Assure-toi du câblage correct (straight-through PC↔switch, switch↔router trunk si besoin).

---

## 2) Accéder au CLI et modes

```
Switch> enable                // mode privilégié
Switch# configure terminal    // mode config global -> Switch(config)#
Router> enable
Router# configure terminal    // Router(config)#
```

---

## 3) Configuration initiale (naming, bannière, timezone, sauvegarde)

**Switch & Router**

```
hostname Switch-Salle1
banner motd #Accès réservé.#
service password-encryption    // chiffre les mots de passe en clair dans running-config
```

Sauvegarder :

```
copy running-config startup-config
// ou
write
```

---

## 4) Switch — configuration VLANs & ports (pas à pas)

### a) Créer VLANs et nommer

```
Switch(config)# vlan 10
Switch(config-vlan)# name Vente
Switch(config-vlan)# exit
Switch(config)# vlan 20
Switch(config-vlan)# name RH
```

### b) Affecter ports en mode access (exemple fa0/1-10 → VLAN10)

```
Switch(config)# interface range fa0/1 - 10
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# exit
```

### c) Configurer un port trunk (vers routeur ou autre switch)

```
Switch(config)# interface fa0/3
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20
Switch(config-if)# exit
```

> Remarque : sur un trunk entre switch et router-on-a-stick → le port switch côté routeur est trunk.

### d) Interface SVI (management IP pour administration du switch)

```
Switch(config)# interface vlan 1
Switch(config-if)# ip address 192.168.10.254 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
```

Teste depuis un PC du même subnet : `ping 192.168.10.254`.

---

## 5) Switch — sécurisation des accès (console / vty / SSH / utilisateurs)

### a) Mot de passe enable (privilégié)

```
Switch(config)# enable secret MonMDPsecurise
```

### b) Password console

```
Switch(config)# line console 0
Switch(config-line)# password MonMDPConsole
Switch(config-line)# login
Switch(config-line)# exit
```

### c) SSH (préférer SSH à Telnet)

```
Switch(config)# ip domain-name monreseau.local
Switch(config)# crypto key generate rsa
  // choisir 2048 bits si demandé
Switch(config)# ip ssh version 2
Switch(config)# username admin privilege 15 secret MonMDP
Switch(config)# line vty 0 4
Switch(config-line)# transport input ssh
Switch(config-line)# login local
Switch(config-line)# exit
```

> Tester depuis PC : `ssh -l admin 192.168.10.254`

---

## 6) Switch — sécurisation des ports (Port Security)

**But :** limiter les MAC sur un port, bloquer périphériques non autorisés.

### a) Activer port-security sur port access

```
Switch(config)# interface fa0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation restrict   // ou shutdown / protect
Switch(config-if)# exit
```

* `mac-address sticky` : apprends dynamiquement et enregistre en running-config (si `copy run start`, persiste).
* `violation` options :

  * `shutdown` → met le port administratively down (par défaut)
  * `restrict` → bloque le trafic non-autorisé et logue
  * `protect` → bloque sans log

### b) Vérifier port-security

```
show port-security
show port-security interface fa0/1
show mac address-table interface fa0/1
```

---

## 7) Switch — bonnes pratiques supplémentaires

* Désactiver ports inutilisés :

```
Switch(config)# interface range fa0/3 - 24
Switch(config-if-range)# shutdown
```

* Toujours `show interfaces status` et `show vlan brief` après changements.
* Annoter la topologie avec **Place Note** dans Packet Tracer et activer **Always Show Port Labels**.

---

## 8) Routeur — configuration d’interfaces & inter-VLAN (router-on-a-stick)

### a) Configuration d’interfaces physiques

```
Router(config)# interface gigabitEthernet0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

### b) Router-on-a-stick (subinterfaces 802.1Q pour inter-VLAN)

```
Router(config)# interface gigabitEthernet0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface gigabitEthernet0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# exit
```

* Ne pas oublier `no shutdown` sur la sous-interface parent si nécessaire :

```
Router(config)# interface gigabitEthernet0/0
Router(config-if)# no shutdown
```

---

## 9) Routeur — sécurisation des accès (enable secret, console, vty, SSH)

```
Router(config)# enable secret Cisco2024
Router(config)# line console 0
Router(config-line)# password admin123
Router(config-line)# login
Router(config-line)# exit

Router(config)# hostname SecureRouter
Router(config)# ip domain-name example.com
Router(config)# crypto key generate rsa
Router(config)# ip ssh version 2
Router(config)# username admin privilege 15 secret MonMDPssh

Router(config)# line vty 0 4
Router(config-line)# transport input ssh
Router(config-line)# login local
Router(config-line)# exit
```

---

## 10) Routage — statique (procédure complète)

**Ajouter une route statique :**

```
Router(config)# ip route <network> <mask> <next-hop>
```

Ex. :

```
ip route 192.168.2.0 255.255.255.0 10.0.0.2
ip route 0.0.0.0 0.0.0.0 10.0.0.1    // route par défaut
```

**Supprimer :**

```
no ip route 192.168.2.0 255.255.255.0 10.0.0.2
```

---

## 11) Routage dynamique — commandes d’activation (extraits)

### RIP v2

```
router rip
 version 2
 network 192.168.1.0
 network 10.0.0.0
```

### OSPF (area 0)

```
router ospf 1
 network 192.168.1.0 0.0.0.255 area 0
 network 10.0.0.0 0.0.0.3 area 0
```

### EIGRP (AS 1)

```
router eigrp 1
 network 192.168.1.0 0.0.0.255
 network 10.10.10.0 0.0.0.3
```

**Vérif :**

```
show ip route       // S / R / O / D / C / L
show ip protocols
show ip ospf neighbor
show ip eigrp neighbors
```

---

## 12) DHCP sur routeur (si besoin)

```
Router(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.10
Router(config)# ip dhcp pool VLAN10
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
```

---

## 13) ACL basique pour sécuriser (exemple : bloquer Telnet vers 192.168.1.100)

**Standard / étendue**

```
Router(config)# access-list 101 deny tcp any host 192.168.1.100 eq 23
Router(config)# access-list 101 permit ip any any
Router(config)# interface gigabitEthernet0/1
Router(config-if)# ip access-group 101 in
```

> Attention à l’ordre des ACLs : première correspondance = action.

---

## 14) Vérifications & commandes utiles (checklist)

**Switch**

```
show vlan brief
show mac address-table
show running-config
show interfaces status
show port-security
show port-security interface fa0/1
```

**Router**

```
show ip interface brief
show ip route
show running-config
show ip arp
show ip protocols
ping <ip>
traceroute <ip>
show ip route ospf
show ip route eigrp
```

---

## 15) Tests de connectivité (procédure)

1. Depuis PC : `ping <gateway>` (ex : `ping 192.168.10.1`).
2. Ping inter-VLAN : PC VLAN10 → PC VLAN20 (si routage inter-VLAN configuré).
3. Ping inter-sites : PC → PC distant via routeur.
4. Si échec : `traceroute` pour localiser saut bloquant, vérifier `show ip route` et `show ip interface brief`.

---

## 16) Dépannage ciblé (symptômes → actions)

* **Interface admin down** (`administratively down`) → `no shutdown`.
* **Aucune route vers réseau distant** → vérifier `show ip route`, ajouter `ip route` ou activer protocole.
* **MAC non apprise** → générer du trafic (ping) puis `show mac address-table`.
* **Port en violation port-security** → `show port-security interface faX` → si `shutdown`, administratively up required (no shutdown on interface-range? or errdisable recovery).
* **SSH inaccessible** → vérifier `ip domain-name`, clé RSA, `ip ssh version 2`, `username` + `line vty transport input ssh` et firewall/ACL côté PC.

---

## 17) Sauvegarde finale & bonnes pratiques

* Sauvegarder immédiatement après tests :

```
copy running-config startup-config
```

* Documenter : VLANs, ports, IPs, mots de passe utilisés (stockés de façon sécurisée hors-ligne).
* Maintenir un plan de secours : floating static route si nécessaire :

```
ip route 192.168.2.0 255.255.255.0 10.0.0.2 250
```

(AD 250 → utilisée seulement si route dynamique non présente.)

---

## 18) Exemple complet — mini-checklist d’exécution (ordre recommandé)

1. Déployer équipements + câblage.
2. Sur switch : `enable` → `hostname` → `service password-encryption`.
3. Créer VLANs (`vlan 10`, `vlan 20`).
4. Affecter ports en `access` / `trunk` (`switchport mode access` / `switchport mode trunk`).
5. Configurer SVI (ip address vlan 1) pour management si voulu.
6. Sécuriser switch : `enable secret`, `line console` pwd, SSH config, `username admin secret ...`.
7. Activer Port-Security sur ports utilisateurs.
8. Désactiver ports inutilisés (`interface range ... shutdown`).
9. Sur router(s) : `hostname`, config interfaces + `no shutdown`.
10. Config inter-VLAN (subinterfaces ou L3 switch).
11. Config routes statiques ou protocole dynamique (EIGRP/OSPF/RIP).
12. Config ACLs / DHCP si nécessaire.
13. Tests : `show ip route`, `ping`, `traceroute`, `show mac address-table`, `show port-security`.
14. Sauvegarde (`write`/`copy run start`).

---