# Fiche — Le routage statique sous **Packet Tracer**

Rapide, pratique et réutilisable : cette fiche contient **définitions**, **quand l’utiliser**, **procédures pas-à-pas (GUI + CLI)**, **exemple complet avec commandes à copier/coller**, **vérifs** et **dépannage**. Toutes les commandes mentionnées dans ton cours sont incluses.

---

## Contexte & définition

* **Routage statique** = configuration MANUELLE des chemins dans la table de routage d’un routeur.
* Chaque route = **réseau destination** + **masque** + **next-hop (passerelle)** ou interface de sortie.
* **Avantages** : simple, stable, contrôle total (utile pour petits réseaux, liens sécurisés, routes de secours).
* **Limites** : ne s’adapte pas automatiquement aux changements de topologie → administration manuelle.

---

## Cas d’usage

* Petits LAN interconnectés.
* Route de secours / lien dédié.
* Environnements très sécurisés où on veut contrôle strict.

---

## Avant de commencer (check-list)

1. Topologie câblée correctement dans Packet Tracer (LEDs, ports).
2. IPs et masques cohérents sur toutes les interfaces.
3. PC : IP, masque, passerelle définis.

---

## 1) Méthode **GUI** dans Packet Tracer (rapide)

1. Cliquer sur le **routeur** → onglet **Config**.
2. Sous **Interface**, sélectionner `GigabitEthernet0/0` (ou autre) :

   * **IP Address** : ex. `192.168.1.1`
   * **Subnet Mask** : `255.255.255.0`
   * **On** (activer l’interface)
3. Répéter pour toutes les interfaces.
4. Dans **Static Routes** :

   * **Network** : `192.168.2.0`
   * **Subnet Mask** : `255.255.255.0`
   * **Next Hop** : `10.0.0.2`
   * Cliquer **Add**
5. Tester avec des **PC** (ping) ou en **Simulation Mode**.
6. Sauvegarder (dans GUI souvent via CLI `write memory`).

---

## 2) Méthode **CLI** (recommandée — identique au réel)

### Accès & modes

* Mode utilisateur : `Router>`
* Passer en privilégié :

```text
Router> enable
Router#
```

* Passer en config globale :

```text
Router# configure terminal
Router(config)#
```

### Configuration d’interfaces (exemples)

```text
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip address 10.0.0.1 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# exit
```

### Ajouter une route statique

```text
Router(config)# ip route 192.168.2.0 255.255.255.0 10.0.0.2
```

* Variante : spécifier interface de sortie au lieu de next-hop (rare) :

```text
Router(config)# ip route 192.168.2.0 255.255.255.0 GigabitEthernet0/1
```

### Supprimer une route statique

```text
Router(config)# no ip route 192.168.2.0 255.255.255.0 10.0.0.2
```

### Sauvegarder la config

```text
Router# write memory
// ou
Router# copy running-config startup-config
```

---

## 3) Exemple complet (Topologie simple à 2 routeurs)

**Topologie**

* Réseau A : `192.168.1.0/24` — RouteurA G0/0 = `192.168.1.1`
* Réseau B : `192.168.2.0/24` — RouteurB G0/0 = `192.168.2.1`
* Lien intermédiaire : `10.0.0.0/30` — RouteurA G0/1 = `10.0.0.1`, RouteurB G0/1 = `10.0.0.2`

**Commandes à entrer sur Routeur A :**

```text
// accéder et configurer interfaces
RouterA> enable
RouterA# configure terminal

RouterA(config)# interface GigabitEthernet0/0
RouterA(config-if)# ip address 192.168.1.1 255.255.255.0
RouterA(config-if)# no shutdown
RouterA(config-if)# exit

RouterA(config)# interface GigabitEthernet0/1
RouterA(config-if)# ip address 10.0.0.1 255.255.255.252
RouterA(config-if)# no shutdown
RouterA(config-if)# exit

// ajouter route statique vers réseau B via 10.0.0.2
RouterA(config)# ip route 192.168.2.0 255.255.255.0 10.0.0.2
RouterA(config)# end
RouterA# write memory
```

**Commandes sur Routeur B :**

```text
RouterB> enable
RouterB# configure terminal

RouterB(config)# interface GigabitEthernet0/0
RouterB(config-if)# ip address 192.168.2.1 255.255.255.0
RouterB(config-if)# no shutdown
RouterB(config-if)# exit

RouterB(config)# interface GigabitEthernet0/1
RouterB(config-if)# ip address 10.0.0.2 255.255.255.252
RouterB(config-if)# no shutdown
RouterB(config-if)# exit

// ajouter route statique vers réseau A via 10.0.0.1
RouterB(config)# ip route 192.168.1.0 255.255.255.0 10.0.0.1
RouterB(config)# end
RouterB# write memory
```

**PC setup**

* PC1 (réseau A) : IP `192.168.1.10` GW `192.168.1.1`
* PC2 (réseau B) : IP `192.168.2.10` GW `192.168.2.1`

**Test**

* Depuis PC1 : `ping 192.168.2.10` → réponses attendues.
* Depuis RouteurA : `show ip route` → tu verras une ligne préfixée `S` (Static).

---

## 4) Vérifications utiles (commande et signification)

* `show ip interface brief` → état et IP des interfaces (`up` / `down` / `administratively down`)
* `show ip route` → table de routage (routes statiques affichées `S`)
* `show running-config` → config en cours (vérifier ip route, interfaces)
* `ping <IP>` → test de connectivité
* `traceroute <IP>` (ou `tracert` depuis PC) → localiser où s’arrête le trafic
* `show interfaces` → vérifier erreurs physiques et counters

---

## 5) Dépannage — erreurs courantes & solutions

1. **Pas de réponse au ping**

   * Vérifier `show ip interface brief` → interface down ? exécuter `no shutdown`.
   * Vérifier IP/mask sur interfaces et PC (cohérence).
   * Vérifier câblage / ports dans Packet Tracer.
2. **Route statique absente**

   * `show ip route` → si pas de `S` : ajouter la route `ip route ...`.
   * Vérifier que next-hop est joignable : `ping <next-hop>`.
3. **Masque incorrect**

   * Connexions partielles ; corriger masque `ip address <IP> <mask>`.
4. **Next-hop incorrect**

   * Next-hop doit être l’IP de l’interface du voisin sur le même segment.
5. **Routes présentes mais trafic bloqué**

   * Vérifier ACLs (si configurées) / firewall sur PC.
6. **Problèmes temporaires** : redémarrage non sauvegarde → utiliser `write memory`.

---

## 6) Bonnes pratiques

* Documente les routes et next-hops.
* Utilise le routage statique pour petits réseaux ou routes fixes ; pour réseaux plus larges, privilégie OSPF/EIGRP/BGP.
* Pour redondance, combine statiques et routage dynamique (ou routes flottantes via `administrative distance`).
* Sauvegarde toujours (`copy running-config startup-config` ou `write memory`).

---

## 7) Récapitulatif — commandes essentielles (copier/coller)

```
enable
configure terminal
interface GigabitEthernet0/0
 ip address 192.168.1.1 255.255.255.0
 no shutdown
 exit
ip route <destination> <mask> <next-hop>
no ip route <destination> <mask> <next-hop>
show ip interface brief
show ip route
show running-config
ping <ip>
traceroute <ip>
write memory
copy running-config startup-config
```

---

## 8) Variante pratique — route par défaut

* Pour envoyer tout trafic non connu vers une passerelle :

```text
Router(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.254
```

---
