# Fiche — **Le routage dynamique** (Cisco Packet Tracer)
---

## 1 — Rappels rapides

* **Routage dynamique** : les routeurs s’échangent automatiquement des informations de routage via un protocole (RIP, OSPF, EIGRP…).
* **Avantage** : adaptation automatique aux changements de topologie.
* **Inconvénient** : complexité et utilisation de CPU/bande passante.
* **Choix** : RIP → petits réseaux ; OSPF → grands réseaux, zones ; EIGRP → Cisco / performant.

---

## 2 — Commandes générales utiles (CLI)

```
enable
configure terminal
exit
show ip interface brief
show ip route
show running-config
show ip protocols
ping <ip>
traceroute <ip>         // ou tracert depuis un PC
write memory
copy running-config startup-config
```

---

## 3 — **RIP** (Routing Information Protocol)

### Quand l’utiliser

* Petits réseaux, topologie simple. Limité à 15 sauts. Version 2 supporte masques CIDR.

### Procédure (CLI)

1. Accéder au routeur :

```text
Router> enable
Router# configure terminal
```

2. Activer RIP et déclarer les réseaux directement connectés :

```text
Router(config)# router rip
Router(config-router)# version 2
Router(config-router)# network 192.168.1.0
Router(config-router)# network 10.0.0.0
Router(config-router)# exit
```

3. Sauvegarder :

```text
Router# write memory
```

### Vérification

```text
Router# show ip route        // routes apprises via RIP marquées 'R'
Router# show running-config  // vérifier router rip / network
Router# debug ip rip         // (optionnel, verbeux) voir échanges RIP en temps réel
```

### Exemple concret (2 routeurs)

**Routeur A**

```text
enable
configure terminal
interface GigabitEthernet0/0
 ip address 192.168.1.1 255.255.255.0
 no shutdown
exit
interface GigabitEthernet0/1
 ip address 10.0.0.1 255.255.255.252
 no shutdown
exit
router rip
 version 2
 network 192.168.1.0
 network 10.0.0.0
end
write memory
```

**Routeur B**

```text
enable
configure terminal
interface GigabitEthernet0/0
 ip address 192.168.2.1 255.255.255.0
 no shutdown
exit
interface GigabitEthernet0/1
 ip address 10.0.0.2 255.255.255.252
 no shutdown
exit
router rip
 version 2
 network 192.168.2.0
 network 10.0.0.0
end
write memory
```

---

## 4 — **OSPF** (Open Shortest Path First)

### Quand l’utiliser

* Grands réseaux, hiérarchie par *areas* (zone 0 = backbone). Convergence rapide, métrique basée sur coûts.

### Procédure (CLI) — config de base

1. Accéder :

```text
Router> enable
Router# configure terminal
```

2. Activer OSPF (process id = 1) et ajouter réseaux avec wildcard mask + area :

```text
Router(config)# router ospf 1
Router(config-router)# network 192.168.10.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.0.0.3 area 0
Router(config-router)# exit
```

3. Sauvegarder :

```text
Router# write memory
```

### Vérification / supervision

```text
Router# show ip ospf neighbor        // voisins OSPF et état (FULL/DR/BDR)
Router# show ip route                // routes OSPF marquées 'O'
Router# show ip ospf                 // infos du processus OSPF
```

### Exemple simple (2 routeurs + backbone area 0)

**Routeur A**

```text
enable
configure terminal
interface GigabitEthernet0/0
 ip address 192.168.10.1 255.255.255.0
 no shutdown
exit
interface GigabitEthernet0/1
 ip address 10.0.0.1 255.255.255.252
 no shutdown
exit
router ospf 1
 network 192.168.10.0 0.0.0.255 area 0
 network 10.0.0.0 0.0.0.3 area 0
end
write memory
```

**Routeur B**

```text
enable
configure terminal
interface GigabitEthernet0/0
 ip address 192.168.20.1 255.255.255.0
 no shutdown
exit
interface GigabitEthernet0/1
 ip address 10.0.0.2 255.255.255.252
 no shutdown
exit
router ospf 1
 network 192.168.20.0 0.0.0.255 area 0
 network 10.0.0.0 0.0.0.3 area 0
end
write memory
```

---

## 5 — **EIGRP** (Enhanced IGRP — propriétaire Cisco)

### Quand l’utiliser

* Réseaux Cisco, besoin de rapidité de convergence et d’efficacité. Combine vecteur de distance et état de lien.

### Procédure (CLI) — config de base

1. Accéder :

```text
Router> enable
Router# configure terminal
```

2. Activer EIGRP (AS = numéro d’autonomous system) et déclarer réseaux :

```text
Router(config)# router eigrp 100
Router(config-router)# network 192.168.1.0
Router(config-router)# network 10.0.0.0
// optionnel : no auto-summary (si classless environnement)
Router(config-router)# no auto-summary
Router(config-router)# exit
```

3. Sauvegarder :

```text
Router# write memory
```

### Vérification

```text
Router# show ip eigrp neighbors
Router# show ip route                // routes EIGRP marquées 'D'
Router# show ip protocols            // info sur le protocole en cours
```

---

## 6 — Vérification & dépannage (tous protocoles)

* `show ip route` → repère les routes apprises (R, O, D, S).
* `show ip interface brief` → interfaces up/down.
* `show running-config` → vérifier `router <protocol>` et les `network`.
* `ping <next-hop>` → vérifier reachability du voisin (next-hop).
* `traceroute` → trouver où s’arrête le trafic.
* `debug ip rip` / `debug ip ospf events` / `debug eigrp packets` → logs en temps réel (utiliser avec prudence).
* **Erreurs fréquentes** :

  * Oublier d’ajouter un réseau (`network`) → pas d’échange pour ce segment.
  * Version RIP mixte (v1 vs v2) → incohérences ; utiliser `version 2`.
  * Mauvais wildcard mask en OSPF → réseau non reconnu.
  * Interfaces administratively down → `no shutdown`.
  * Problèmes de MTU / ACLs bloquant les protocoles.

---

## 7 — Bonnes pratiques

* Documenter AS (EIGRP), process-id (OSPF) et réseaux annoncés.
* Pour OSPF, bien planifier area 0 (backbone) et la hiérarchie.
* Ne pas activer `debug` en production sans supervision (verbeux).
* Sauvegarder config après validation : `write memory`.
* Utiliser `show ip protocols` pour vérifier timers et informations diffusées.

---

## 8 — Résumé rapide des commandes spécifiques citées dans ton cours

```
router rip
 version 2
 network <network>

debug ip rip
show ip route

router ospf 1
 network <network> <wildcard> area <area>
show ip ospf neighbor
show ip ospf

router eigrp <AS>
 network <network>
 no auto-summary
show ip eigrp neighbors
```

---