# **Fiche de révision : Paramétrer un routeur et un switch sous Packet Tracer**

## **Objectif**

Maîtriser la configuration initiale, la création de VLANs, la sécurisation des ports, la configuration des interfaces et des routes sur les switches et routeurs Cisco dans Packet Tracer, et tester la connectivité.

---

## **Concepts clés**

### **1. Switch**

* Connecte plusieurs périphériques au sein d’un **réseau local (LAN)**.
* Permet la segmentation via les **VLANs** pour sécurité et optimisation du trafic.
* **CLI** (Command Line Interface) : interface textuelle pour configurer le switch.

### **2. Routeur**

* Connecte plusieurs réseaux (LAN, WAN) et achemine les données selon les routes définies.
* Chaque interface représente un réseau ou un sous-réseau.
* Nécessite **activation et configuration d’adresses IP** pour chaque interface.

### **3. VLAN (Virtual LAN)**

* Segmente un réseau physique en réseaux logiques.
* Identifiés par un **ID (1-4095)** et un nom.
* Les ports configurés en **mode access** ne peuvent appartenir qu’à un seul VLAN.
* **Trunk** : permet à plusieurs VLANs de transiter sur un seul port.

### **4. Sécurisation des ports**

* Limite le nombre de périphériques et contrôle les adresses MAC autorisées.
* Commandes principales : `switchport port-security`, `maximum <nombre>`, `mac-address sticky`.
* Comportements en cas de violation : `shutdown | restrict | protect`.

---

## **Configuration d’un switch**

### **1. Accès au CLI et définition du hostname**

```
Switch> enable
Switch# configure terminal
Switch(config)# hostname SwitchSalle1
SwitchSalle1(config)#
```

* Modes CLI :

  * `>` : utilisateur limité
  * `#` : mode privilégié
  * `(config)#` : mode configuration globale

---

### **2. Création et gestion des VLANs**

```
SwitchSalle1(config)# vlan 10
SwitchSalle1(config-vlan)# name Vente
SwitchSalle1(config)# vlan 20
SwitchSalle1(config-vlan)# name RH
```

### **Affectation des ports aux VLANs**

```
SwitchSalle1(config)# interface range fa0/1 - 10
SwitchSalle1(config-if-range)# switchport mode access
SwitchSalle1(config-if-range)# switchport access vlan 10
```

### **Configuration d’un port trunk**

```
SwitchSalle1(config)# interface fa0/3
SwitchSalle1(config-if)# switchport mode trunk
SwitchSalle1(config-if)# switchport trunk allowed vlan 10,20
```

---

### **3. Sécurisation des ports**

```
SwitchSalle1(config)# interface fa0/1
SwitchSalle1(config-if)# switchport mode access
SwitchSalle1(config-if)# switchport port-security
SwitchSalle1(config-if)# switchport port-security maximum 2
SwitchSalle1(config-if)# switchport port-security mac-address sticky
SwitchSalle1(config-if)# switchport port-security violation shutdown
```

### **Vérification de la configuration**

```
show vlan brief          // Affiche tous les VLANs et ports associés
show running-config       // Affiche la configuration complète
show port-security interface fa0/1 // Vérifie les ports sécurisés
```

### **Sauvegarde**

```
copy running-config startup-config
show startup-config
```

---

## **Configuration d’un routeur**

### **1. Connexion et hostname**

```
Router> enable
Router# configure terminal
Router(config)# hostname Routeur-Salle1
Routeur-Salle1(config)#
```

### **2. Configuration des interfaces**

```
Routeur-Salle1(config)# interface gigabitEthernet0/0.10
Routeur-Salle1(config-if)# encapsulation dot1Q 10
Routeur-Salle1(config-if)# ip address 192.168.10.1 255.255.255.0
Routeur-Salle1(config-if)# exit

Routeur-Salle1(config)# interface gigabitEthernet0/0.20
Routeur-Salle1(config-if)# encapsulation dot1Q 20
Routeur-Salle1(config-if)# ip address 192.168.20.1 255.255.255.0
Routeur-Salle1(config-if)# exit

Routeur-Salle1(config)# interface gigabitEthernet0/0
Routeur-Salle1(config-if)# no shutdown
Routeur-Salle1(config-if)# exit
```

### **3. Configuration des routes statiques**

```
Routeur-Salle1(config)# ip route 192.168.2.0 255.255.255.0 192.168.1.2
Routeur-Salle1(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.2  // route par défaut
```

### **Vérification**

```
show ip route          // Affiche les routes connues
show ip interface brief // Vérifie l’état des interfaces
```

### **Sauvegarde**

```
copy running-config startup-config
```

---

## **Tests de connectivité**

* **Ping entre équipements**

```
PC> ping 192.168.10.1
```

* **Traceroute pour déboguer**

```
PC> tracert 192.168.20.1
```

* Vérifier que :

  * Les adresses IP et masques sont corrects
  * Interfaces activées (`no shutdown`)
  * Routes correctement configurées
  * Connexions physiques valides

---

## **Résumé**

1. **Switch :** hostname → VLANs → affectation des ports → sécurisation → vérification → sauvegarde
2. **Routeur :** hostname → interfaces → routes statiques → vérification → sauvegarde
3. **Tests :** ping et traceroute pour vérifier la connectivité
4. **CLI :** accès structuré selon le mode : utilisateur limité → privilégié → configuration globale

**Commandes CLI essentielles réutilisables :**

```
enable
configure terminal
hostname <nom>
interface <nom_interface>
ip address <IP> <masque>
no shutdown
vlan <ID>
name <nom_vlan>
switchport mode access
switchport access vlan <ID>
switchport mode trunk
switchport trunk allowed vlan <IDs>
switchport port-security
switchport port-security maximum <nombre>
switchport port-security mac-address sticky
switchport port-security violation {shutdown|restrict|protect}
show vlan brief
show running-config
show startup-config
show port-security interface <interface>
show ip route
show ip interface brief
ip route <destination> <masque> <passerelle>
copy running-config startup-config
ping <IP>
tracert <IP>
```

---